; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-6-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-1 - location
	p0-2 - location
	p0-5 - location
	p0-11 - location
	p2-3 - location
	p2-5 - location
	p2-9 - location
	p3-4 - location
	p3-5 - location
	p3-8 - location
	p3-10 - location
	p4-0 - location
	p4-1 - location
	p4-3 - location
	p4-6 - location
	p4-8 - location
	p4-10 - location
	p5-8 - location
	p5-10 - location
	p6-3 - location
	p6-7 - location
	p8-1 - location
	p9-0 - location
	p10-1 - location
	)
	(:init
	(at driver1 s11)
	(at driver2 s11)
	(at driver3 s1)
	(at driver4 s8)
	(at truck1 s6)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s10)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s8)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s6)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s6)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s0)
	(at package2 s0)
	(at package3 s10)
	(at package4 s2)
	(at package5 s2)
	(at package6 s10)
	(at package7 s1)
	(at package8 s5)
	(at package9 s8)
	(at package10 s3)
	(at package11 s10)
	(at package12 s2)
	(at package13 s11)
	(at package14 s9)
	(at package15 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-11)
	(path p0-11 s0)
	(path s11 p0-11)
	(path p0-11 s11)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 13)
	(= (time-to-drive s7 s0) 13)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 70)
	(= (time-to-drive s9 s0) 70)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 70)
	(= (time-to-drive s10 s0) 70)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 87)
	(= (time-to-drive s0 s1) 87)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 96)
	(= (time-to-drive s6 s1) 96)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 95)
	(= (time-to-drive s1 s2) 95)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 79)
	(= (time-to-drive s4 s2) 79)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 19)
	(= (time-to-drive s8 s2) 19)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 54)
	(= (time-to-drive s0 s3) 54)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 13)
	(= (time-to-drive s1 s3) 13)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 16)
	(= (time-to-drive s2 s3) 16)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 71)
	(= (time-to-drive s5 s3) 71)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 82)
	(= (time-to-drive s6 s3) 82)
	(link s3 s11)
	(link s11 s3)
	(= (time-to-drive s3 s11) 43)
	(= (time-to-drive s11 s3) 43)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 67)
	(= (time-to-drive s9 s4) 67)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 34)
	(= (time-to-drive s0 s5) 34)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 85)
	(= (time-to-drive s8 s6) 85)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 29)
	(= (time-to-drive s9 s6) 29)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 8)
	(= (time-to-drive s10 s6) 8)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 10)
	(= (time-to-drive s2 s7) 10)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 67)
	(= (time-to-drive s6 s7) 67)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 62)
	(= (time-to-drive s7 s8) 62)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 60)
	(= (time-to-drive s2 s9) 60)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 25)
	(= (time-to-drive s3 s9) 25)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 24)
	(= (time-to-drive s7 s9) 24)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 20)
	(= (time-to-drive s1 s10) 20)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 73)
	(= (time-to-drive s4 s10) 73)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 82)
	(= (time-to-drive s7 s10) 82)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 62)
	(= (time-to-drive s8 s10) 62)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 38)
	(= (time-to-drive s11 s10) 38)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 75)
	(= (time-to-drive s1 s11) 75)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 74)
	(= (time-to-drive s4 s11) 74)
	(link s11 s5)
	(link s5 s11)
	(= (time-to-drive s11 s5) 8)
	(= (time-to-drive s5 s11) 8)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 44)
	(= (time-to-drive s9 s11) 44)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s0)
	(at driver4 s9)
	(at truck1 s3)
	(at truck3 s8)
	(at truck5 s10)
	(at truck6 s2)
	(at package1 s1)
	(at package2 s1)
	(at package3 s2)
	(at package4 s11)
	(at package5 s5)
	(at package6 s4)
	(at package7 s6)
	(at package8 s3)
	(at package9 s10)
	(at package10 s4)
	(at package12 s5)
	(at package13 s4)
	(at package14 s6)
	(at package15 s9)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   goals met: 0 of 21
2. (load-truck package9 truck4 s8)
   deleted: (at package9 s8)
   added: (in package9 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 0 of 21
3. (board-truck driver4 truck4 s8)
   deleted: (at driver4 s8) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 0 of 21
4. (drive-truck truck4 s8 s6 driver4)
   deleted: (at truck4 s8)
   added: (at truck4 s6)
   changed: (fuel-used) from 0 to 935
   goals met: 0 of 21
5. (drive-truck truck4 s6 s9 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   changed: (fuel-used) from 935 to 1254
   goals met: 0 of 21
6. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   goals met: 1 of 21
7. (drive-truck truck4 s9 s3 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   changed: (fuel-used) from 1254 to 1529
   goals met: 1 of 21
8. (load-truck package15 truck4 s3)
   deleted: (at package15 s3)
   added: (in package15 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 1 of 21
9. (drive-truck truck4 s3 s9 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s9)
   changed: (fuel-used) from 1529 to 1854
   goals met: 1 of 21
10. (load-truck package14 truck4 s9)
   deleted: (at package14 s9)
   added: (in package14 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 1 of 21
11. (unload-truck package15 truck4 s9)
   deleted: (in package15 truck4)
   added: (at package15 s9)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 2 of 21
12. (drive-truck truck4 s9 s6 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   changed: (fuel-used) from 1854 to 2231
   goals met: 2 of 21
13. (unload-truck package14 truck4 s6)
   deleted: (in package14 truck4)
   added: (at package14 s6)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 3 of 21
14. (walk driver2 s11 p0-11)
   deleted: (at driver2 s11)
   added: (at driver2 p0-11)
   goals met: 3 of 21
15. (walk driver2 p0-11 s0)
   deleted: (at driver2 p0-11)
   added: (at driver2 s0)
   goals met: 3 of 21
16. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   goals met: 2 of 21
17. (drive-truck truck4 s6 s3 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (fuel-used) from 2231 to 3133
   goals met: 2 of 21
18. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   goals met: 2 of 21
19. (walk driver2 s0 p4-0)
   deleted: (at driver2 s0)
   added: (at driver2 p4-0)
   goals met: 2 of 21
20. (load-truck package10 truck4 s3)
   deleted: (at package10 s3)
   added: (in package10 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 2 of 21
21. (drive-truck truck4 s3 s6 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s6)
   changed: (fuel-used) from 3133 to 4199
   goals met: 2 of 21
22. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 2 of 21
23. (walk driver2 p4-0 s4)
   deleted: (at driver2 p4-0)
   added: (at driver2 s4)
   goals met: 3 of 21
24. (drive-truck truck4 s6 s9 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   changed: (fuel-used) from 4199 to 4576
   goals met: 3 of 21
25. (drive-truck truck4 s9 s0 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s0)
   changed: (fuel-used) from 4576 to 5486
   goals met: 3 of 21
26. (walk driver2 s4 p4-6)
   deleted: (at driver2 s4)
   added: (at driver2 p4-6)
   goals met: 2 of 21
27. (load-truck package1 truck4 s0)
   deleted: (at package1 s0)
   added: (in package1 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 2 of 21
28. (load-truck package2 truck4 s0)
   deleted: (at package2 s0)
   added: (in package2 truck4)
   changed: (load truck4) from 3 to 4, (fuel-per-minute truck4) from 16 to 20
   goals met: 2 of 21
29. (drive-truck truck4 s0 s5 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   changed: (fuel-used) from 5486 to 6166
   goals met: 2 of 21
30. (load-truck package8 truck4 s5)
   deleted: (at package8 s5)
   added: (in package8 truck4)
   changed: (load truck4) from 4 to 5, (fuel-per-minute truck4) from 20 to 25
   goals met: 2 of 21
31. (drive-truck truck4 s5 s11 driver4)
   deleted: (at truck4 s5)
   added: (at truck4 s11)
   changed: (fuel-used) from 6166 to 6366
   goals met: 2 of 21
32. (load-truck package13 truck4 s11)
   deleted: (at package13 s11)
   added: (in package13 truck4)
   changed: (load truck4) from 5 to 6, (fuel-per-minute truck4) from 25 to 31
   goals met: 2 of 21
33. (drive-truck truck4 s11 s4 driver4)
   deleted: (at truck4 s11)
   added: (at truck4 s4)
   changed: (fuel-used) from 6366 to 8660
   goals met: 2 of 21
34. (unload-truck package10 truck4 s4)
   deleted: (in package10 truck4)
   added: (at package10 s4)
   changed: (load truck4) from 6 to 5, (fuel-per-minute truck4) from 31 to 25
   goals met: 3 of 21
35. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 4 of 21
36. (drive-truck truck4 s4 s2 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   changed: (fuel-used) from 8660 to 10635
   goals met: 4 of 21
37. (load-truck package4 truck4 s2)
   deleted: (at package4 s2)
   added: (in package4 truck4)
   changed: (load truck4) from 5 to 6, (fuel-per-minute truck4) from 25 to 31
   goals met: 4 of 21
38. (load-truck package5 truck4 s2)
   deleted: (at package5 s2)
   added: (in package5 truck4)
   changed: (load truck4) from 6 to 7, (fuel-per-minute truck4) from 31 to 38
   goals met: 4 of 21
39. (load-truck package12 truck4 s2)
   deleted: (at package12 s2)
   added: (in package12 truck4)
   changed: (load truck4) from 7 to 8, (fuel-per-minute truck4) from 38 to 46
   goals met: 4 of 21
40. (drive-truck truck4 s2 s4 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   changed: (fuel-used) from 10635 to 14269
   goals met: 4 of 21
41. (unload-truck package13 truck4 s4)
   deleted: (in package13 truck4)
   added: (at package13 s4)
   changed: (load truck4) from 8 to 7, (fuel-per-minute truck4) from 46 to 38
   goals met: 5 of 21
42. (drive-truck truck4 s4 s11 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s11)
   changed: (fuel-used) from 14269 to 17081
   goals met: 5 of 21
43. (unload-truck package4 truck4 s11)
   deleted: (in package4 truck4)
   added: (at package4 s11)
   changed: (load truck4) from 7 to 6, (fuel-per-minute truck4) from 38 to 31
   goals met: 6 of 21
44. (drive-truck truck4 s11 s5 driver4)
   deleted: (at truck4 s11)
   added: (at truck4 s5)
   changed: (fuel-used) from 17081 to 17329
   goals met: 6 of 21
45. (unload-truck package5 truck4 s5)
   deleted: (in package5 truck4)
   added: (at package5 s5)
   changed: (load truck4) from 6 to 5, (fuel-per-minute truck4) from 31 to 25
   goals met: 7 of 21
46. (unload-truck package12 truck4 s5)
   deleted: (in package12 truck4)
   added: (at package12 s5)
   changed: (load truck4) from 5 to 4, (fuel-per-minute truck4) from 25 to 20
   goals met: 8 of 21
47. (drive-truck truck4 s5 s3 driver4)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   changed: (fuel-used) from 17329 to 18749
   goals met: 8 of 21
48. (unload-truck package8 truck4 s3)
   deleted: (in package8 truck4)
   added: (at package8 s3)
   changed: (load truck4) from 4 to 3, (fuel-per-minute truck4) from 20 to 16
   goals met: 9 of 21
49. (drive-truck truck4 s3 s2 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (fuel-used) from 18749 to 19005
   goals met: 9 of 21
50. (drive-truck truck4 s2 s4 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   changed: (fuel-used) from 19005 to 20269
   goals met: 9 of 21
51. (walk driver2 p4-6 s6)
   deleted: (at driver2 p4-6)
   added: (at driver2 s6)
   goals met: 9 of 21
52. (board-truck driver2 truck6 s6)
   deleted: (at driver2 s6) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 9 of 21
53. (drive-truck truck6 s6 s1 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s1)
   changed: (fuel-used) from 20269 to 21229
   goals met: 9 of 21
54. (drive-truck truck4 s4 s10 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s10)
   changed: (fuel-used) from 21229 to 22397
   goals met: 9 of 21
55. (drive-truck truck6 s1 s2 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   changed: (fuel-used) from 22397 to 23347
   goals met: 10 of 21
56. (unload-truck package9 truck4 s10)
   deleted: (in package9 truck4)
   added: (at package9 s10)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 11 of 21
57. (load-truck package3 truck4 s10)
   deleted: (at package3 s10)
   added: (in package3 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 11 of 21
58. (load-truck package6 truck4 s10)
   deleted: (at package6 s10)
   added: (in package6 truck4)
   changed: (load truck4) from 3 to 4, (fuel-per-minute truck4) from 16 to 20
   goals met: 11 of 21
59. (drive-truck truck4 s10 s6 driver4)
   deleted: (at truck4 s10)
   added: (at truck4 s6)
   changed: (fuel-used) from 23347 to 23507
   goals met: 11 of 21
60. (disembark-truck driver2 truck6 s2)
   deleted: (driving driver2 truck6)
   added: (at driver2 s2) (empty truck6)
   goals met: 11 of 21
61. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 11 of 21
62. (drive-truck truck3 s2 s4 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (fuel-used) from 23507 to 24297
   goals met: 11 of 21
63. (drive-truck truck4 s6 s1 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s1)
   changed: (fuel-used) from 24297 to 26217
   goals met: 11 of 21
64. (unload-truck package1 truck4 s1)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   changed: (load truck4) from 4 to 3, (fuel-per-minute truck4) from 20 to 16
   goals met: 12 of 21
65. (unload-truck package2 truck4 s1)
   deleted: (in package2 truck4)
   added: (at package2 s1)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 13 of 21
66. (load-truck package7 truck4 s1)
   deleted: (at package7 s1)
   added: (in package7 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 13 of 21
67. (drive-truck truck4 s1 s6 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s6)
   changed: (fuel-used) from 26217 to 27753
   goals met: 13 of 21
68. (unload-truck package7 truck4 s6)
   deleted: (in package7 truck4)
   added: (at package7 s6)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 14 of 21
69. (drive-truck truck4 s6 s9 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   changed: (fuel-used) from 27753 to 28130
   goals met: 14 of 21
70. (drive-truck truck3 s4 s10 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s10)
   changed: (fuel-used) from 28130 to 28860
   goals met: 14 of 21
71. (drive-truck truck3 s10 s6 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s6)
   changed: (fuel-used) from 28860 to 28940
   goals met: 14 of 21
72. (disembark-truck driver2 truck3 s6)
   deleted: (driving driver2 truck3)
   added: (at driver2 s6) (empty truck3)
   goals met: 14 of 21
73. (drive-truck truck4 s9 s2 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s2)
   changed: (fuel-used) from 28940 to 29720
   goals met: 14 of 21
74. (unload-truck package3 truck4 s2)
   deleted: (in package3 truck4)
   added: (at package3 s2)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 15 of 21
75. (drive-truck truck4 s2 s4 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   changed: (fuel-used) from 29720 to 30589
   goals met: 15 of 21
76. (unload-truck package6 truck4 s4)
   deleted: (in package6 truck4)
   added: (at package6 s4)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 16 of 21
77. (drive-truck truck4 s4 s9 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s9)
   changed: (fuel-used) from 30589 to 31259
   goals met: 16 of 21
78. (disembark-truck driver4 truck4 s9)
   deleted: (driving driver4 truck4)
   added: (at driver4 s9) (empty truck4)
   goals met: 17 of 21
79. (board-truck driver2 truck1 s6)
   deleted: (at driver2 s6) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 17 of 21
80. (drive-truck truck1 s6 s3 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   changed: (fuel-used) from 31259 to 32079
   goals met: 18 of 21
81. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 18 of 21
82. (walk driver2 s3 p6-3)
   deleted: (at driver2 s3)
   added: (at driver2 p6-3)
   goals met: 18 of 21
83. (walk driver2 p6-3 s6)
   deleted: (at driver2 p6-3)
   added: (at driver2 s6)
   goals met: 18 of 21
84. (board-truck driver2 truck5 s6)
   deleted: (at driver2 s6) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 18 of 21
85. (drive-truck truck5 s6 s10 driver2)
   deleted: (at truck5 s6)
   added: (at truck5 s10)
   changed: (fuel-used) from 32079 to 32159
   goals met: 19 of 21
86. (drive-truck truck5 s10 s4 driver2)
   deleted: (at truck5 s10)
   added: (at truck5 s4)
   changed: (fuel-used) from 32159 to 32889
   goals met: 18 of 21
87. (disembark-truck driver2 truck5 s4)
   deleted: (driving driver2 truck5)
   added: (at driver2 s4) (empty truck5)
   goals met: 19 of 21
88. (walk driver2 s4 p4-6)
   deleted: (at driver2 s4)
   added: (at driver2 p4-6)
   goals met: 18 of 21
89. (walk driver2 p4-6 s6)
   deleted: (at driver2 p4-6)
   added: (at driver2 s6)
   goals met: 18 of 21
90. (board-truck driver2 truck3 s6)
   deleted: (at driver2 s6) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 18 of 21
91. (drive-truck truck3 s6 s8 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   changed: (fuel-used) from 32889 to 33739
   goals met: 19 of 21
92. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 18 of 21
93. (walk driver3 p4-0 s4)
   deleted: (at driver3 p4-0)
   added: (at driver3 s4)
   goals met: 18 of 21
94. (board-truck driver3 truck5 s4)
   deleted: (at driver3 s4) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 18 of 21
95. (drive-truck truck5 s4 s9 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s9)
   changed: (fuel-used) from 33739 to 34409
   goals met: 18 of 21
96. (disembark-truck driver2 truck3 s8)
   deleted: (driving driver2 truck3)
   added: (at driver2 s8) (empty truck3)
   goals met: 18 of 21
97. (walk driver2 s8 p4-8)
   deleted: (at driver2 s8)
   added: (at driver2 p4-8)
   goals met: 18 of 21
98. (drive-truck truck5 s9 s11 driver3)
   deleted: (at truck5 s9)
   added: (at truck5 s11)
   changed: (fuel-used) from 34409 to 34849
   goals met: 18 of 21
99. (walk driver2 p4-8 s4)
   deleted: (at driver2 p4-8)
   added: (at driver2 s4)
   goals met: 19 of 21
100. (disembark-truck driver3 truck5 s11)
   deleted: (driving driver3 truck5)
   added: (at driver3 s11) (empty truck5)
   goals met: 19 of 21
101. (walk driver3 s11 p0-11)
   deleted: (at driver3 s11)
   added: (at driver3 p0-11)
   goals met: 19 of 21
102. (walk driver3 p0-11 s0)
   deleted: (at driver3 p0-11)
   added: (at driver3 s0)
   goals met: 20 of 21
103. (board-truck driver1 truck5 s11)
   deleted: (at driver1 s11) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 20 of 21
104. (drive-truck truck5 s11 s10 driver1)
   deleted: (at truck5 s11)
   added: (at truck5 s10)
   changed: (fuel-used) from 34849 to 35229
   goals met: 21 of 21
